In [1]:
Done
Welcome Aditya Modi from Using Databases with Python

To get credit for this assignment, perform the instructions below and enter the code you get here: 

 
(Hint: starts with 436)
Instructions
If you don't already have it, install the SQLite Browser from http://sqlitebrowser.org/.

Then, create a SQLITE database or use an existing database and create a table in the database called "Ages":

CREATE TABLE Ages ( 
  name VARCHAR(128), 
  age INTEGER
)
Then make sure the table is empty by deleting any rows that you previously inserted, and insert these rows and only these rows with the following commands:

DELETE FROM Ages;
INSERT INTO Ages (name, age) VALUES ('Caelainn', 34);
INSERT INTO Ages (name, age) VALUES ('Roy', 24);
INSERT INTO Ages (name, age) VALUES ('Chardonnay', 28);
INSERT INTO Ages (name, age) VALUES ('Shihed', 19);
INSERT INTO Ages (name, age) VALUES ('Zachariah', 30);
INSERT INTO Ages (name, age) VALUES ('Jazz', 25);
Once the inserts are done, run the following SQL command:
SELECT hex(name || age) AS X FROM Ages ORDER BY X
Find the first row in the resulting record set and enter the long string that looks like 53656C696E613333.
Note: This assignment must be done using SQLite - in particular, the SELECT query above will not work in any other database. So you cannot use MySQL or Oracle for this assignment.

Select Language​▼

SyntaxError: invalid syntax (<ipython-input-1-c1d39bd81820>, line 2)

In [ ]:
# CREATE TABLE Ages ( 
#   name VARCHAR(128), 
#   age INTEGER
# )

# DELETE FROM Ages;
# INSERT INTO Ages (name, age) VALUES ('Caelainn', 34);
# INSERT INTO Ages (name, age) VALUES ('Roy', 24);
# INSERT INTO Ages (name, age) VALUES ('Chardonnay', 28);
# INSERT INTO Ages (name, age) VALUES ('Shihed', 19);
# INSERT INTO Ages (name, age) VALUES ('Zachariah', 30);
# INSERT INTO Ages (name, age) VALUES ('Jazz', 25);


# SELECT hex(name || age) AS X FROM Ages ORDER BY X